openfoam/NASA_hump_data_jan25_fine_zero_ic/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-5;
 
boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1e-5;
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottomWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    hump
    {
        type            fixedValue;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}