openfoam/NASA_hump_data_jan25_fine_zero_ic/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-6.39     0         0)   //0
    (-0.06     0         0)   //1 Bit upstream to smoothen the spline
    (-0.3      1         0)   //2 Changed
    (-6.39     1         0)   //3
    (0.654157  0.115013  0)   //4
    (0.97      1         0)   //5 Changed
    (0.658481  0.113582  0)   //6
    (0.98      1         0)   //7 Changed
    (0.654157  0.114408  0)   //8
    (0.655758  0.112948  0)   //9
    (0.547620 -0.060522  0)   //10
    (0.668573 -0.060522  0)   //11
    (1.06      0         0)   //12 Bit downstream to smoothen the spline
    (1.4       1         0)   //13 Changed
    (5         0         0)   //14
    (5         1         0)   //15
    (-6.39     0         0.1) //16
    (-0.06     0         0.1) //17 Bit upstream to smoothen the spline
    (-0.3      1         0.1) //18 Changed
    (-6.39     1         0.1) //19
    (0.654157  0.115013  0.1) //20
    (0.97      1         0.1) //21 Changed
    (0.658481  0.113582  0.1) //22
    (0.98      1         0.1) //23 Changed
    (0.654157  0.114408  0.1) //24
    (0.655758  0.112948  0.1) //25
    (0.547620 -0.060522  0.1) //26
    (0.668573 -0.060522  0.1) //27
    (1.06      0         0.1) //28 Bit downstream to smoothen the spline
    (1.4       1         0.1) //29 Changed
    (5         0         0.1) //30
    (5         1         0.1) //31
    (-5        0         0)   //32 To correct inlet singularities
    (-5        1         0)   //33 To correct inlet singularities
    (-5        0         0.1) //34 To correct inlet singularities
    (-5        1         0.1) //35 To correct inlet singularities
    (0        0          0)   //36 
    (0        0          0.1)   //37
    (1        0          0)   //38
    (1        0          0.1)   //39
    (-0.1     1          0)   //40
    (-0.1     1       0.1)   //41
    (1.34       1         0)   //42
    (1.34       1        0.1)   //43
);

blocks
(
    //0  Inlet
    hex (0 32 33 3 16 34 35 19) (20 96 1) 
    simpleGrading (10 9156 1)

    //1 Upstream 1
    hex (32 1 2 33 34 17 18 35) (160 96 1) 
    simpleGrading
    (
        (
            (0.7 0.3 0.2)
            (0.3 0.7 0.2)
        )
        9156 
        1
    )

    //2 Upstream 2
    hex (1 36 40 2 17 37 41 18) (20 96 1) 
    simpleGrading (1 9156 1)

    //3 Hump 1
    hex (36 4 5 40 37 20 21 41)   (120 96 1) 
    simpleGrading 
    (
        (
            (0.5 0.3 3)
            (0.5 0.7 0.05)
        )
        //0.01
        9156 
        1
    )

    //4 Jet
    hex (4 6 7 5 20 22 23 21) (20 96 1) 
    simpleGrading 
    (
        1
        9156 
        1
    )

    //5  Hump 2
    //hex (6 12 13 7 22 28 29 23)  (150 50 1) 
    hex (6 38 42 7 22 39 43 23)  (200 96 1)
    simpleGrading 
    (
        (
            (0.5 0.6 3)
            (0.5 0.4 0.6)
        )
        9156 
        1
    )

    //6  Downstream 1
    hex (38 12 13 42 39 28 29 43) (20 96 1)
    simpleGrading (2 9156 1)

    //7 Downstream 2
    hex (12 14 15 13 28 30 31 29) (160 96 1) 
    simpleGrading
    (
        (
            (0.2 0.7 3)
            (0.8 0.3 10)  
        )  
        9156
        1
    )
);

edges
(
    spline 36 4
    (
        #include "include/coords1"
    )
    spline 6 38
    (
        #include "include/coords5"
    )
    spline 37 20
    (
        #include "include/coords10"
    )
    spline 22 39
    (
        #include "include/coords50"
    )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (3 0 16 19)
        );
    }
    topWall
    {
        type symmetry;
        faces
        (
            (33 3 19 35) 
            (2 33 35 18)
            (5 40 41 21)
            (40 2 18 41)
            (7 5 21 23)
            (13 42 43 29)
            (42 7 23 43)
            (15 13 29 31)
        );
    }
    jet
    {
        type patch;
        faces
        (
            (4 6 22 20)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (14 15 31 30)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (0 32 34 16)
            (32 1 17 34)
            (1 36 37 17)
            (38 12 28 39)
            (12 14 30 28)
        );
    }
    hump
    {
        type wall;
        faces
        (
            (36 4 20 37)
            (6 38 39 22)
        );
    }

        //defaultFaces
    //{
        //type empty;
        //faces
       // (
        //    (0 3 33 32)
        //    (32 33 2 1)
        //   (1 2 5 4)
        //    (4 5 7 6)
        //    (6 7 13 12)
        //    (12 13 15 14)
        //    //
        //    (16 34 35 19)
        //    (34 17 18 35)
        //    (17 20 21 18)
        //    (20 22 23 21)
        //   (22 28 29 23)
        //    (28 30 31 29)
        //);
    //}
);

mergePatchPairs
(
);

// ************************************************************************* //
