openfoam/NASA_hump_data_jan25_fine_zero_ic/system/include/coords2
(0.654157 0.115013 0)
(0.654157 0.114408 0)
